src/InformationRegisters/ЛогированиеРегламентныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЛогированиеРегламентныхЗаданий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусВыполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗаданий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Миллисекунды</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПопытки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПовторовПриАварийномЗавершении</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭксклюзивноеВыполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыполнятьЧерезРегламентноеЗадание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаУниверсальная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияУниверсальная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяВарианта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПользовательОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяРегламентногоЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СостоянияЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СостоянияЗаданий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запланировано</Name>
					<Comment>Задание запланировано на выполнение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
					<Comment>Задание выполняется</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
					<Comment>Задание завершено</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗапланировано</Name>
					<Comment>Задание не запланировано</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаВыполнения</Name>
					<Comment>Ошибка при выполнении задания</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеАктивно</Name>
					<Comment>Задание не активно</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработкаОшибкиПриАварийномЗавершении</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ОчередьЗаданийОбластейДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ОчередьЗаданийОбластейДанных</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Использование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапланированныйМоментЗапуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Миллисекунды</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЗадания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗаданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполняющееФоновоеЗадание</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭксклюзивноеВыполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныЗаданийОчереди</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПопытки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМетода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПоследнегоЗапуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершенияПоследнегоЗапуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалПовтораПриАварийномЗавершении</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПовторовПриАварийномЗавершении</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/ЛогированиеРегламентныхЗаданий/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Процедура - Зафиксировать начало выполнения регламентного задания
//
// Параметры:
//  РегламентноеЗадание	 - 	 - 
//
Процедура ЗафиксироватьНачалоВыполненияРегламентногоЗадания(РегламентноеЗадание = Неопределено) Экспорт
	
	Если РегламентноеЗадание = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		МассивИменЗаданийВМоделиСервиса = Новый Массив;
		#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда	
			ОчередьЗаданийПереопределяемый.ПриПолученииСпискаШаблонов(МассивИменЗаданийВМоделиСервиса);
		#КонецЕсли
		ПриПолученииДополнительныхЗаданийДляЛогирования(МассивИменЗаданийВМоделиСервиса);
		Если МассивИменЗаданийВМоделиСервиса.Найти(РегламентноеЗадание.Имя) = Неопределено Тогда 
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	
	Если РегламентноеЗадание.Имя = "ОбновлениеЗакрытияДней" Тогда 
		ОчиститьЖурналЛогирования();		
	КонецЕсли;
	
	ДатаНачалаВыполнения 		= ТекущаяДата();
	ДатаНачалаУниверсальная 	= ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	НаборЗаписейЗадания = СоздатьНаборЗаписей();
	НаборЗаписейЗадания.Отбор.ИмяРегламентногоЗадания.Установить(РегламентноеЗадание.Имя);
	НаборЗаписейЗадания.Отбор.ДатаНачала.Установить(ДатаНачалаВыполнения);
	
	НоваяЗапись							= НаборЗаписейЗадания.Добавить();
	НоваяЗапись.СтатусВыполнения 		= Перечисления.СостоянияЗаданий.Выполняется;
	
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда 
		ПараметрыЗаданияОбласти = ПолучитьПараметрыЗаданияОбласти(РегламентноеЗадание);
		Если НЕ ПараметрыЗаданияОбласти = Неопределено Тогда 
			ЗаполнитьЗначенияСвойств(НоваяЗапись, ПараметрыЗаданияОбласти);
			Если ПараметрыЗаданияОбласти.Использование = Ложь Тогда 
				НоваяЗапись.СтатусВыполнения = Перечисления.СостоянияЗаданий.НеАктивно;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	НоваяЗапись.ИмяРегламентногоЗадания	= РегламентноеЗадание.Имя;
	НоваяЗапись.ДатаНачала				= ДатаНачалаВыполнения;
	НоваяЗапись.ДатаНачалаУниверсальная = ДатаНачалаУниверсальная;
	
	НаборЗаписейЗадания.ОбменДанными.Загрузка = Истина;
	НаборЗаписейЗадания.Записать();
	
КонецПроцедуры	

// Процедура - Зафиксировать окончание выполнения регламентного задания
//
// Параметры:
//  РегламентноеЗадание		 - 	 - 
//  ОписаниеОшибкиВыполнения - 	 - 
//
Процедура ЗафиксироватьОкончаниеВыполненияРегламентногоЗадания(РегламентноеЗадание = Неопределено, ОписаниеОшибкиВыполнения = "") Экспорт
	
	Если РегламентноеЗадание = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		МассивИменЗаданийВМоделиСервиса = Новый Массив;
		#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда	
			ОчередьЗаданийПереопределяемый.ПриПолученииСпискаШаблонов(МассивИменЗаданийВМоделиСервиса);
		#КонецЕсли
		ПриПолученииДополнительныхЗаданийДляЛогирования(МассивИменЗаданийВМоделиСервиса);		
		Если МассивИменЗаданийВМоделиСервиса.Найти(РегламентноеЗадание.Имя) = Неопределено Тогда 
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	
	ДатаОкончанияВыполнения 	= ТекущаяДата();
	ДатаОкончанияУниверсальная 	= ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ЗаписьНачалаЗадания = ПолучитьПоследнююЗаписьЗадания(РегламентноеЗадание);
	Если ЗаписьНачалаЗадания = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	НаборЗаписейЗадания = СоздатьНаборЗаписей();
	НаборЗаписейЗадания.Отбор.ИмяРегламентногоЗадания.Установить(РегламентноеЗадание.Имя);
	НаборЗаписейЗадания.Отбор.ДатаНачала.Установить(ЗаписьНачалаЗадания.ДатаНачала);

	НоваяЗапись								= НаборЗаписейЗадания.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяЗапись, ЗаписьНачалаЗадания);
	НоваяЗапись.ДатаОкончания 				= ДатаОкончанияВыполнения;
	Если ЗначениеЗаполнено(ОписаниеОшибкиВыполнения) Тогда 
		НоваяЗапись.СтатусВыполнения 		= Перечисления.СостоянияЗаданий.ОшибкаВыполнения;
		НоваяЗапись.ОписаниеОшибки 			= ОписаниеОшибкиВыполнения;
	Иначе 	
		НоваяЗапись.СтатусВыполнения 		= Перечисления.СостоянияЗаданий.Завершено;
	КонецЕсли;	
	НоваяЗапись.ДатаОкончанияУниверсальная 	= ДатаОкончанияУниверсальная;
	НоваяЗапись.Миллисекунды 				= (НоваяЗапись.ДатаОкончанияУниверсальная - ЗаписьНачалаЗадания.ДатаНачалаУниверсальная) / 1000;
	
	НаборЗаписейЗадания.ОбменДанными.Загрузка = Истина;
	НаборЗаписейЗадания.Записать();
	
КонецПроцедуры	

// Функция - Получить параметры задания области
//
// Параметры:
//  РегламентноеЗадание	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПараметрыЗаданияОбласти(РегламентноеЗадание) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИмяЗадания", РегламентноеЗадание.Имя);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОчередьЗаданийОбластейДанных.ОбластьДанныхВспомогательныеДанные КАК ОбластьДанныхВспомогательныеДанные,
	|	ОчередьЗаданийОбластейДанных.Использование КАК Использование,
	|	ОчередьЗаданийОбластейДанных.ДатаНачалаПоследнегоЗапуска КАК ДатаНачалаПоследнегоЗапуска,
	|	ОчередьЗаданийОбластейДанных.ДатаЗавершенияПоследнегоЗапуска КАК ДатаЗавершенияПоследнегоЗапуска,
	|	ОчередьЗаданийОбластейДанных.Миллисекунды КАК Миллисекунды,
	|	ОчередьЗаданийОбластейДанных.НомерПопытки КАК НомерПопытки,
	|	ОчередьЗаданийОбластейДанных.КоличествоПовторовПриАварийномЗавершении КАК КоличествоПовторовПриАварийномЗавершении,
	|	ОчередьЗаданийОбластейДанных.ЭксклюзивноеВыполнение КАК ЭксклюзивноеВыполнение,
	|	ОчередьЗаданийОбластейДанных.ВыполнятьЧерезРегламентноеЗадание КАК ВыполнятьЧерезРегламентноеЗадание
	|ИЗ
	|	Справочник.ОчередьЗаданийОбластейДанных КАК ОчередьЗаданийОбластейДанных
	|ГДЕ
	|	ОчередьЗаданийОбластейДанных.Шаблон.Имя = &ИмяЗадания
	|	И ОчередьЗаданийОбластейДанных.ПометкаУдаления = ЛОЖЬ";
	
	ВыборкаЗадания = Запрос.Выполнить().Выбрать();
	Если ВыборкаЗадания.Следующий() Тогда 
		Возврат ВыборкаЗадания;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции	

// Функция - Получить последнюю запись задания
//
// Параметры:
//  РегламентноеЗадание	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПоследнююЗаписьЗадания(РегламентноеЗадание) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИмяЗадания", РегламентноеЗадание.Имя);	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЛогированиеРегламентныхЗаданий.ДатаНачала КАК ДатаНачала,
	               |	ЛогированиеРегламентныхЗаданий.ИмяРегламентногоЗадания КАК ИмяРегламентногоЗадания,
	               |	ЛогированиеРегламентныхЗаданий.СтатусВыполнения КАК СтатусВыполнения,
	               |	ЛогированиеРегламентныхЗаданий.Миллисекунды КАК Миллисекунды,
	               |	ЛогированиеРегламентныхЗаданий.НомерПопытки КАК НомерПопытки,
	               |	ЛогированиеРегламентныхЗаданий.КоличествоПовторовПриАварийномЗавершении КАК КоличествоПовторовПриАварийномЗавершении,
	               |	ЛогированиеРегламентныхЗаданий.ЭксклюзивноеВыполнение КАК ЭксклюзивноеВыполнение,
	               |	ЛогированиеРегламентныхЗаданий.ВыполнятьЧерезРегламентноеЗадание КАК ВыполнятьЧерезРегламентноеЗадание,
	               |	ЛогированиеРегламентныхЗаданий.ДатаНачалаУниверсальная КАК ДатаНачалаУниверсальная,
	               |	ЛогированиеРегламентныхЗаданий.ДатаОкончанияУниверсальная КАК ДатаОкончанияУниверсальная
	               |ИЗ
	               |	РегистрСведений.ЛогированиеРегламентныхЗаданий КАК ЛогированиеРегламентныхЗаданий
	               |ГДЕ
	               |	ЛогированиеРегламентныхЗаданий.ИмяРегламентногоЗадания = &ИмяЗадания
	               |	И ЛогированиеРегламентныхЗаданий.СтатусВыполнения В (ЗНАЧЕНИЕ(Перечисление.СостоянияЗаданий.Выполняется), ЗНАЧЕНИЕ(Перечисление.СостоянияЗаданий.НеАктивно))
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаНачала УБЫВ";
	
	ВыборкаЗаписиЗадания = Запрос.Выполнить().Выбрать();
	Если ВыборкаЗаписиЗадания.Следующий() Тогда 
		Возврат ВыборкаЗаписиЗадания;
	Иначе 	
		Возврат Неопределено;
	КонецЕсли; 
	
КонецФункции

// Процедура - Очистить журнал логирования
//
Процедура ОчиститьЖурналЛогирования() Экспорт 
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛогированиеРегламентныхЗаданий.ИмяРегламентногоЗадания КАК ИмяРегламентногоЗадания,
	|	ЛогированиеРегламентныхЗаданий.ДатаНачала КАК ДатаНачала,
	|	ЛогированиеРегламентныхЗаданий.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	РегистрСведений.ЛогированиеРегламентныхЗаданий КАК ЛогированиеРегламентныхЗаданий
	|ГДЕ
	|	ЛогированиеРегламентныхЗаданий.ДатаНачала < ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, -3)";
	
	ВыборкаСтарыхЗаписей = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаСтарыхЗаписей.Следующий() Цикл
		НаборЗаписейЗадания = СоздатьНаборЗаписей();
		НаборЗаписейЗадания.Отбор.ИмяРегламентногоЗадания.Установить(ВыборкаСтарыхЗаписей.ИмяРегламентногоЗадания);
		НаборЗаписейЗадания.Отбор.ДатаНачала.Установить(ВыборкаСтарыхЗаписей.ДатаНачала);
		НаборЗаписейЗадания.Отбор.ДатаОкончания.Установить(ВыборкаСтарыхЗаписей.ДатаОкончания);
		НаборЗаписейЗадания.ОбменДанными.Загрузка = Истина;
		НаборЗаписейЗадания.Записать();
	КонецЦикла;
	
КонецПроцедуры

// Процедура - При получении дополнительных заданий для логирования
//
// Параметры:
//  ШаблоныЗаданий	 - 	 - 
//
Процедура ПриПолученииДополнительныхЗаданийДляЛогирования(ШаблоныЗаданий) Экспорт
	
	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.ОбслуживаниеОбластейДанных.Имя);
	
КонецПроцедуры	

// Процедура - Зафиксировать начало формирования отчета
//
// Параметры:
//  ИмяОтчета	 - 	 - 
//  ИмяВарианта	 - 	 - 
//
Процедура ЗафиксироватьНачалоФормированияОтчета(ИмяОтчета = Неопределено, ИмяВарианта = Неопределено, ТекущийПользователь = Неопределено) Экспорт

	Если ИмяОтчета = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	ДатаНачалаВыполнения 		= ТекущаяДата();
	ДатаНачалаУниверсальная 	= ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	НаборЗаписейОтчета = СоздатьНаборЗаписей();
	НаборЗаписейОтчета.Отбор.ИмяРегламентногоЗадания.Установить(ИмяОтчета);
	НаборЗаписейОтчета.Отбор.ДатаНачала.Установить(ДатаНачалаВыполнения);
	Если ЗначениеЗаполнено(ТекущийПользователь) Тогда 
		НаборЗаписейОтчета.Отбор.Пользователь.Установить(ТекущийПользователь);
	КонецЕсли;	
	
	НоваяЗапись							= НаборЗаписейОтчета.Добавить();
	НоваяЗапись.СтатусВыполнения 		= Перечисления.СостоянияЗаданий.Выполняется;
	НоваяЗапись.ИмяРегламентногоЗадания	= ИмяОтчета;
	Если ЗначениеЗаполнено(ТекущийПользователь) Тогда 	
		НоваяЗапись.Пользователь 		= ТекущийПользователь;
		НоваяЗапись.ПользовательОтчета	= Строка(ТекущийПользователь);
	КонецЕсли;	
	НоваяЗапись.ДатаНачала				= ДатаНачалаВыполнения;
	НоваяЗапись.ДатаНачалаУниверсальная = ДатаНачалаУниверсальная;
	НоваяЗапись.ИмяВарианта 			= ИмяВарианта;
	НоваяЗапись.Отчет 					= Истина;
	
	НаборЗаписейОтчета.ОбменДанными.Загрузка = Истина;
	НаборЗаписейОтчета.Записать();	
	
КонецПроцедуры

// Процедура - Зафиксировать окончание формирования отчета
//
// Параметры:
//  ИмяОтчета				 - 	 - 
//  ИмяВарианта				 - 	 - 
//  ТекущийПользователь		 - 	 - 
//  ОписаниеОшибкиВыполнения - 	 - 
//
Процедура ЗафиксироватьОкончаниеФормированияОтчета(ИмяОтчета = Неопределено, ИмяВарианта = Неопределено, ТекущийПользователь = Неопределено, ОписаниеОшибкиВыполнения = "") Экспорт
	
	Если ИмяОтчета = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	ДатаОкончанияВыполнения 	= ТекущаяДата();
	ДатаОкончанияУниверсальная 	= ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ЗаписьНачалаФормированияОтчета = ПолучитьПоследнююЗаписьОтчета(ИмяОтчета, ТекущийПользователь);
	Если ЗаписьНачалаФормированияОтчета = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	НаборЗаписейОтчета = СоздатьНаборЗаписей();
	НаборЗаписейОтчета.Отбор.ИмяРегламентногоЗадания.Установить(ИмяОтчета);
	НаборЗаписейОтчета.Отбор.ДатаНачала.Установить(ЗаписьНачалаФормированияОтчета.ДатаНачала);
	Если ЗначениеЗаполнено(ТекущийПользователь) Тогда 
		НаборЗаписейОтчета.Отбор.Пользователь.Установить(ТекущийПользователь);
	КонецЕсли;	

	НоваяЗапись								= НаборЗаписейОтчета.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяЗапись, ЗаписьНачалаФормированияОтчета);
	НоваяЗапись.ДатаОкончания 				= ДатаОкончанияВыполнения;
	Если НЕ ЗначениеЗаполнено(НоваяЗапись.Пользователь) И ЗначениеЗаполнено(ТекущийПользователь) Тогда 	
		НоваяЗапись.Пользователь 			= ТекущийПользователь;
	КонецЕсли;
	Если ЗначениеЗаполнено(НоваяЗапись.Пользователь) Тогда 
		НоваяЗапись.ПользовательОтчета	= Строка(НоваяЗапись.Пользователь);	
	КонецЕсли;		
	Если ЗначениеЗаполнено(ОписаниеОшибкиВыполнения) Тогда 
		НоваяЗапись.СтатусВыполнения 		= Перечисления.СостоянияЗаданий.ОшибкаВыполнения;
		НоваяЗапись.ОписаниеОшибки 			= ОписаниеОшибкиВыполнения;
	Иначе 	
		НоваяЗапись.СтатусВыполнения 		= Перечисления.СостоянияЗаданий.Завершено;
	КонецЕсли;	
	НоваяЗапись.ДатаОкончанияУниверсальная 	= ДатаОкончанияУниверсальная;
	НоваяЗапись.Миллисекунды 				= (НоваяЗапись.ДатаОкончанияУниверсальная - ЗаписьНачалаФормированияОтчета.ДатаНачалаУниверсальная) / 1000;
	Если НЕ ЗначениеЗаполнено(НоваяЗапись.ИмяВарианта) И ЗначениеЗаполнено(ИмяВарианта) Тогда 
		НоваяЗапись.ИмяВарианта 			= ИмяВарианта;
	КонецЕсли;	
	НоваяЗапись.Отчет 						= Истина;
	
	НаборЗаписейОтчета.ОбменДанными.Загрузка = Истина;
	НаборЗаписейОтчета.Записать();
	
КонецПроцедуры	

// Функция - Получить последнюю запись отчета
//
// Параметры:
//  ИмяОтчета	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПоследнююЗаписьОтчета(ИмяОтчета, ТекущийПользователь = Неопределено) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИмяЗадания", ИмяОтчета);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЛогированиеРегламентныхЗаданий.ДатаНачала КАК ДатаНачала,
	               |	ЛогированиеРегламентныхЗаданий.ИмяРегламентногоЗадания КАК ИмяРегламентногоЗадания,
	               |	ЛогированиеРегламентныхЗаданий.Пользователь КАК Пользователь,
	               |	ЛогированиеРегламентныхЗаданий.СтатусВыполнения КАК СтатусВыполнения,
	               |	ЛогированиеРегламентныхЗаданий.Миллисекунды КАК Миллисекунды,
	               |	ЛогированиеРегламентныхЗаданий.НомерПопытки КАК НомерПопытки,
	               |	ЛогированиеРегламентныхЗаданий.КоличествоПовторовПриАварийномЗавершении КАК КоличествоПовторовПриАварийномЗавершении,
	               |	ЛогированиеРегламентныхЗаданий.ЭксклюзивноеВыполнение КАК ЭксклюзивноеВыполнение,
	               |	ЛогированиеРегламентныхЗаданий.ВыполнятьЧерезРегламентноеЗадание КАК ВыполнятьЧерезРегламентноеЗадание,
	               |	ЛогированиеРегламентныхЗаданий.ДатаНачалаУниверсальная КАК ДатаНачалаУниверсальная,
	               |	ЛогированиеРегламентныхЗаданий.ДатаОкончанияУниверсальная КАК ДатаОкончанияУниверсальная,
	               |	ЛогированиеРегламентныхЗаданий.ИмяВарианта КАК ИмяВарианта
	               |ИЗ
	               |	РегистрСведений.ЛогированиеРегламентныхЗаданий КАК ЛогированиеРегламентныхЗаданий
	               |ГДЕ
	               |	ЛогированиеРегламентныхЗаданий.ИмяРегламентногоЗадания = &ИмяЗадания
	               |	И &УсловиеПользователь
	               |	И ЛогированиеРегламентныхЗаданий.СтатусВыполнения В (ЗНАЧЕНИЕ(Перечисление.СостоянияЗаданий.Выполняется), ЗНАЧЕНИЕ(Перечисление.СостоянияЗаданий.НеАктивно))
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаНачала УБЫВ";
	
	Если ЗначениеЗаполнено(ТекущийПользователь) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПользователь", "ЛогированиеРегламентныхЗаданий.Пользователь = &Пользователь");
		Запрос.УстановитьПараметр("Пользователь", ТекущийПользователь);
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПользователь", "ИСТИНА");
	КонецЕсли;	
	
	ВыборкаЗаписиОтчета = Запрос.Выполнить().Выбрать();
	Если ВыборкаЗаписиОтчета.Следующий() Тогда 
		Возврат ВыборкаЗаписиОтчета;
	Иначе 	
		Возврат Неопределено;
	КонецЕсли; 
	
КонецФункции

#КонецОбласти
